Autodesk.Revit.UI.ExternalCommandsData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.ExternalCommandsData.AvailabilityClassName
The full class name for the class providing the entry point to decide availability of this menu item.
Remarks:
This is the class implementing IExternalCommandAvailability interface.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2025

Autodesk.Revit.UI.ExternalCommandsData.AssemblyName
The assembly path of the menu item.
Remarks:
The path of the assembly which contains the corresponding external command.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2025

Autodesk.Revit.UI.ExternalCommandsData.ClassName
The name of the class containing the implementation for the command.
Remarks:
The class name which implements the interface IExternalCommand.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2025

Autodesk.Revit.UI.ExternalCommandsData
Base class used to contain external command information necessary to construct PushButtonData and MenuItem.
Since:
2025